Repository: devdaydresden/devday_website
Catalog: devday/sponsoring/locale/*/LC_MESSAGES/django.po
Languages: de

source: Sponsor Management
de: Sponsorenverwaltung

source: Your organization
de: Deine Organisation

source: Contact email address
de: Kontaktemailadresse

source: Your request
de: Deine Anfrage

source: Interested in sponsoring packages
de: Interessiert an folgenden Sponsoringpaketen

source: Custom
de: Sonstiges

source: Sponsoring request
de: Sponsoringanfrage

source: Send sponsoring request
de: Sponsoringanfrage senden

source: Silver
de: Silber

source: Event
de: Veranstaltung

source: Package
de: Paket

source: Price
de: Preis

source: Sponsoring Package
de: Sponsoringpaket

source: Sponsoring Packages
de: Sponsoringpakete

source: Description
de: Beschreibung

source: Header
de: Überschrift

source: Sponsoring Package Item
de: Sponsoringpaketbestandteil

source: Sponsoring Package Items
de: Sponsoringpaketbestandteile

source: Sponsoring Options
de: Sponsoringmöglichkeiten

source: Please have a look at the following list of sponsoring options.
de: Schau dir die folgende Liste von Sponsoringmöglichkeiten an.

source: There are no sponsoring packages defined yet.
de: Es wurden noch keine Sponsoringpakete definiert.

source: Hello Sponsoring Team, the following sponsoring request for %(event)s has been sent from the Website. %(organization)s wrote the following request:
de: Hallo Sponsoring-Team, die folgende Sponsoringanfrage für %(event)s wurde von der Website gesendet. %(organization)s schrieb die folgende Anfrage:

source: The requester is interested in the following sponsoring oportunity:
de: Der Anfragende ist an der folgenden Sponsoringmöglichkeit interessiert:

source: Sent from %(scheme)s://%(domain)s%(path)s Remote %(remote)s Host %(host)s
de: Gesendet von %(scheme)s://%(domain)s%(path)s Remote %(remote)s Host %(host)s

source: Sponsoring request for %(event)s from %(organization)s
de: Sponsoringanfrage für %(event)s von %(organization)s

source: Thank you
de: Danke

source: Thank you for your sponsoring request. We will contact you.
de: Danke für deine Sponsoringanfrage. Wir werden Kontakt mit dir aufnehmen.

source: Back to <a href="%(index_url)s">the Homepage</a>.
de: Zurück <a href="%(index_url)s">zur Startseite</a>.
