Repository: devdaydresden/devday_website
Catalog: devday/devday/locale/*/LC_MESSAGES/django.po
Languages: de

source: Register now for {}
de: Jetzt anmelden für {}

source: Submit session for {}
de: Session einreichen für {}

source: Vote for your favourite sessions
de: Stimme für deine bevorzugten Sessions

source: Archive
de: Archiv

source: Profile
de: Profil

source: Settings
de: Einstellungen

source: Checkin QR Code
de: QR-Code für Checkin

source: Speaker Profile
de: SpeakerIn-Profil

source: Program Committee
de: Programmkomittee

source: Logout
de: Abmelden

source: Send Email
de: Email senden

source: Reports as CSV
de: CSV-Reports

source: Inactive users
de: Inaktive Benutzer

source: Users we may contact
de: Benutzer, die kontaktiert werden dürfen

source: Current event attendees
de: Teilnehmer der aktuellen Veranstaltung

source: Current event session summary
de: Sessionzusammenfassung für aktuelles Event

source: Actions used on stage during event
de: Aktionen während des Events

source: Raffle
de: Verlosung

source: Event feedback
de: Feedback zur Veranstaltung

source: Session feedback
de: Feedback zu den Sessions

source: Unsupported image file format {}
de: Nicht unterstütztes Bild-Dateiformat {}

source: Change my password
de: Mein Passwort ändern

source: Reset my password
de: Mein Passwort zurücksetzen

source: invalid email address {}
de: ungültige E-Mailadresse {}

source: Recipient Group
de: Empfängergruppe

source: Recipient List
de: Empfängerliste

source: a list of recipient email addresses (one address on each line)
de: Eine Liste von Empfänger-E-Mailadressen (eine Adresse pro Zeile)

source: Email Subject
de: Email-Betreff

source: Recipients for this email
de: Empfänger für diese Email

source: Email Body
de: Email-Text

source: Send Test Email To Myself
de: Test-Email an mich selbst senden

source: Send Email To Selected Recipients
de: Email an ausgewählte Empfängergruppe senden

source: Image in carousel
de: Bild in Karussel

source: First image in carousel
de: Erstes Bild in Karussel

source: Image in galery
de: Bild in Galerie

source: Dev Day Page
de: Dev-Day-Seite

source: Dev Day Page with Call to Action area
de: Dev-Day-Seite mit Call-to-Action-Bereich

source: Page with all static placeholders not for menu
de: Seite mit allen statischen Platzhaltern, nicht im Menü verlinken

source: Bad Request
de: Ungültige Anfrage

source: Page not found
de: Seite nicht gefunden

source: Django Administration
de: Django-Verwaltung

source: Documentation
de: Dokumentation

source: Change password
de: Passwort ändern

source: Log out
de: Ausloggen

source: Open
de: Öffne

source: my site
de: meine Seite

source: Thanks to our sponsors
de: Danke an unsere Sponsoren

source: Privacy policy
de: Datenschutzhinweise

source: Imprint
de: Impressum

source: Please correct the error below.
de: Bitte den unten aufgeführten Fehler korrigieren.

source: Please correct the errors below.
de: Bitte die unten aufgeführten Fehler korrigieren.

source: Static placeholders
de: Statische Platzhalter

source: This is a list of all static placeholders. The template devday/templates/devday_all_static_placeholders.html must be modified if a new static placeholder is introduced.
de: Dies ist eine Liste aller statischen Platzhalter (static_placeholder). Das Template devday/templates/devday_all_static_placeholders.html muss angepasst werden, wenn ein neuer statischer Platzhalter eingeführt wird.

source: Reserve your spot in one of the workshops or the excursion.
de: Reserviere deinen Platz für einen der Workshops oder die Exkursion.

source: Register spots
de: Plätze reservieren

source: Sign up now - Be part of it!
de: Jetzt anmelden - Sei dabei!

source: Submit session now
de: Jetzt eine Session einreichen

source: Please give us feedback!
de: Bitte gib uns Feedback!

source: Give feedback
de: Feedback geben

source: Cancel
de: Abbrechen

source: Retry
de: Wiederholen

source: Choose Image
de: Bild wählen

source: Activation failed.
de: Aktivierung fehlgeschlagen.

source: You specified an invalid activation code or your code has expired.
de: Du hast einen ungültigen Aktivierungscode angegeben oder der Code ist bereits abgelaufen.

source: Registration: activation complete
de: Registrierung: Aktivierung abgeschlossen

source: Account activated
de: Benutzerkonto aktiviert

source: You have activated your Dev Day account successfully.
de: Dein Dev Day Benutzerkonto wurde erfolgreich aktiviert.

source: Continue to <a href="%(root_page)s">home page</a>.
de: Weiter zur <a href="%(root_page)s">Startseite</a>.

source: Continue to <a href="%(login_page)s">login</a>.
de: Weiter zum <a href="%(login_page)s">Login</a>.

source: Registration: activation failed
de: Registrierung: Aktivierung fehlgeschlagen

source: Account activation failed
de: Aktivierung des Benutzerkontos fehlgeschlagen

source: Back to <a href="%(root_page)s">home page</a>.
de: Zurück zur <a href="%(root_page)s">Startseite</a>.

source: Forgot password?
de: Passwort vergessen?

source: Reset it
de: Zurücksetzen

source: Not registered yet?
de: Noch nicht angemeldet?

source: Register
de: Anmelden

source: Logged out
de: Abgemeldet

source: You are now logged out.
de: Du bist jetzt abgemeldet.

source: Password changed
de: Passwort geändert

source: Password change
de: Passwortänderung

source: Your password has been changed.
de: Dein Passwort wurde geändert.

source: Visit <a href="%(user_profile)s">your user profile</a> to review your registrations.
de: Besuche dein <a href="%(user_profile)s">Benutzerprofil</a>, um deine Anmeldungen zu prüfen.

source: Password set
de: Passwort geändert

source: Your password has been set. You may go ahead and log in now.
de: Dein Passwort wurde gesetzt. Du kannst jetzt damit fortfahren dich einzuloggen.

source: Password recovery
de: Passwortwiederherstellung

source: Please enter your new password twice so we can verify you typed it in correctly.
de: Bitte gib dein neues Passwort doppelt ein, damit wir prüfen können, dass du es richtig getippt hast.

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
de: Der Link für die Passwortrücksetzung war ungültig, vielleicht wurde er schon einmal benutzt. Bitte fordere eine neue Passwortrücksetzung an.

source: We've emailed you instructions for setting your password, if an account exists with the email you entered. You should receive them shortly.
de: Wir haben dir Hinweise zum Setzen deines Passworts gemailt, falls ein Nutzerkonto mit der eingegebenen E-Mail-Adresse existiert. Du solltest diese in Kürze erhalten.

source: If you don't receive an email, please make sure you've entered the address you registered with, and check your spam folder.
de: Wenn du keine E-Mail erhalten solltest, prüfe bitte, ob die eingegebene E-Mailadresse die ist, mit der du dich bei uns angemeldet hast und prüfe deinen Spam-Ordner.

source: You're receiving this email because you requested a password reset for your user account at %(site_name)s.
de: Du bekommst diese E-Mail weil eine Passwortrücksetzung für dein Nutzerkonto auf %(site_name)s angefordert wurde.

source: Please go to the following page and choose a new password:
de: Bitte klicke folgenden Link und wähle ein neues Passwort:

source: Your username, in case you've forgotten:
de: Dein Nutzername, falls du diesen vergessen hast:

source: Thanks for using our site!
de: Danke, dass du unsere Webseite nutzt!

source: The %(site_name)s team
de: Dein %(site_name)s team

source: Forgotten your password? Enter your email address below, and we'll email instructions for setting a new one.
de: Hast du dein Passwort vergessen? Gib unten deine E-Mail-Adresse ein und wir werden dir Hinweise schicken, wie du ein neues Passwort setzen kannst.

source: Password reset on %(site_name)s
de: Passwortrücksetzung auf %(site_name)s

source: Registration closed
de: Registrierung geschlossen

source: Our registration is closed. Thanks for your interest. Unfortunately we cannot accept more attendees.
de: Unsere Anmeldung ist geschlossen. Danke für dein Interesse. Leider können wir keine weiteren Teilnehmer annehmen.

source: Registration: confirm email address
de: Anmeldung: Email-Adresse bestätigen

source: Almost done
de: Fast fertig

source: Thank you for registering for Dev Day. To complete registration, please click on the confirmation link we just sent you by email!
de: Vielen Dank, dass du dich für den Dev Day angemeldet hast! Um die Anmeldung abzuschließen, klicke bitte den Bestätigungslink, den wir dir gerade per Email geschickt haben!

source: Register for Dev Day
de: Für den Dev Day registrieren

source: Dev Day Attendees {}
de: Dev Day Teilnehmer {}

source: past and present attendees
de: Frühere und aktuelle Teilnehmer

source: past attendees
de: Frühere Teilnehmer

source: current attendees
de: Teilnehmer der aktuellen Veranstaltung

source: registered but inactive attendees
de: registrierte aber inaktive Teilnehmer

source: candidate speakers
de: SpeakerIn-Kandidaten

source: accepted speakers
de: Angenommene SpeakerIn

source: email addresses from uploaded file
de: E-Mailadressen aus hochgeladener Datei

source: Successfully sent message to {} {} recipients
de: Email erfolgreich an {} {} versendet

source: Successfully sent message for {} to yourself
de: Test-Email für {} erfolgreich an dich selbst gesendet
