Repository: devdaydresden/devday_website
Catalog: devday/talk/locale/*/LC_MESSAGES/django.po
Languages: de

source: Draft speakers
de: Unbestätigte SpeakerInnen

source: Publish selected sessions
de: Ausgewählte Sessions veröffentlichen

source: A confirmation mail has been sent to %(attendees)s.
de: Eine Bestätigungs-E-Mail wurde an %(attendees)s gesendet.

source: Process waiting list for selected sessions
de: Warteliste für ausgewählte Sessions verarbeiten

source: Talk slot created successfully
de: Talk-Slot erfolgreich angelegt

source: Event
de: Veranstaltung

source: Submit
de: Session einreichen

source: Update session
de: Session aktualisieren

source: Add comment
de: Kommentar hinzufügen

source: Submit your feedback
de: Feedback abschicken

source: Speaker (draft)
de: SpeakerIn (Entwurf)

source: Speaker (public)
de: SpeakerIn (öffentlich)

source: Session title
de: Sessionname

source: Abstract
de: Kurzbeschreibung

source: Remarks
de: Anmerkungen

source: Talk Formats
de: Session-Formate

source: Spots
de: Plätze

source: Maximum number of attendees for this talk
de: Maximale Anzahl von Teilnehmern für diese Session

source: Talk
de: Session

source: Speaker
de: SpeakerIn

source: Talk draft speaker
de: Session unbestätigte SpeakerIn

source: Talk draft speakers
de: Session unbestätigte SpeakerInnen

source: Published speaker
de: Veröffentlichte SpeakerInnen

source: Talk published speaker
de: Veröffentlichte/r SpeakerIn

source: Talk published speakers
de: Veröffentlichte/r SpeakerInnen

source: Cannot delete last draft speaker from talk without published speaker
de: Ein/e SpeakerIn (Entwurf) oder SpeakerIn (öffentlich) ist erforderlich

source: Cannot delete last published speaker from talk without draft speaker
de: Ein/e SpeakerIn (öffentlich) oder SpeakerIn (Entwurf) ist erforderlich

source: Slides
de: Folien

source: Source code
de: Quellcode

source: Comment
de: Kommentar

source: Visible for Speaker
de: Sichtbar für den/die SpeakerIn

source: Indicates whether the comment is visible to the speaker.
de: Gibt an, ob der Kommentar für den/die SpeakerIn sichtbar ist.

source: Priority
de: Priorität

source: Room
de: Raum

source: Rooms
de: Räume

source: Time slot
de: Zeitslot

source: Time slots
de: Zeitslots

source: Talk slot
de: Session-Slot

source: Talk slots
de: Session-Slots

source: Duration
de: Länge

source: Talk Format
de: Session-Format

source: Attendee
de: Teilnehmer

source: Confirmed
de: Bestätigt

source: On waiting list
de: Auf der Warteliste

source: Session reservation
de: Platzreservierung

source: Session reservations
de: Platzreservierungen

source: Attendee vote
de: Teilnehmerabstimmung

source: Attendee votes
de: Teilnehmerabstimmungen

# attendee feedback singular form
source: Attendee feedback
de: Teilnehmerfeedback

# attendee feedback plural form
source: Attendee feedback
de: Teilnehmerfeedback

source: You are about to publish the following items. Please select a track for each item.
de: Du bist dabei die folgenden Sessions zu veröffentlichen. Bitte wähle einen Track für jede Session aus.

source: Publish talks
de: Sessions veröffentlichen

source: first step
de: Anfang

source: prev step
de: Ende

source: submit
de: Absenden

source: You already have an account
de: Du hast bereits ein Benutzerkonto

source: Reset it
de: Passwort zurücksetzen

source: You have no account yet?
de: Du hast noch kein Benutzerkonto?

source: Register as speaker
de: Als SpeakerIn registrieren

source: Hello, you want to reserve a spot for „%(title)s“! Follow the link below to confirm your reservation %(scheme)s://%(domain)s%(confirmation_url)s The link is valid for one day. The Dev Day team
de: Hallo, du möchtest einen Platz für „%(title)s“ reservieren! Bitte folge dem unten stehenden Link, um deine Reservierung zu bestätigen %(scheme)s://%(domain)s%(confirmation_url)s Der Link ist für einen Tag gültig. Das Dev Day Team

source: Waiting list removal for „%(title)s“
de: Wartelistenentfernung für „%(title)s“

source: Cancel reservation for „%(title)s“
de: Reservierung für „%(title)s“ stornieren

source: Remove yourself from the waiting list
de: Von der Warteliste nehmen

source: Please click on the button below to remove yourself from the waiting list for „%(title)s“.
de: Bitte klicke auf den Button unten, um dich aus der Warteliste für „%(title)s“ entfernen zu lassen.

source: Cancel your reservation
de: Deine Reservierung stornieren

source: Please click on the button below to cancel your reservation for „%(title)s“.
de: Bitte klicke auf den Button unten, um deine Reservierung für „%(title)s“ zu stornieren.

source: Remove me from the waiting list
de: Aus der Warteliste entfernen

source: Cancel reservation
de: Reservierung stornieren

source: Confirmation failed
de: Bestätigung fehlgeschlagen

source: Your spot could not be confirmed
de: Deine Platzreservierung konnte nicht bestätigt werden

source: We could not reserve your spot for „%(title)s“.
de: Wir konnten deinen Platz für „%(title)s“ nicht reservieren.

source: You will get notified if another attendees' reservation is withdrawn.
de: Du wirst benachrichtigt, wenn die Reservierung eines anderen Teilnehmers zurückgezogen wird.

source: We could not process your confirmation link.
de: Wir konnten deinen Bestätigungslink nicht verarbeiten.

source: Confirm your reservation for „%(title)s“
de: Bestätige deine Reservierung für „%(title)s“

source: Confirmation email for „%(title)s“ sent
de: Bestätigungs-E-Mail für „%(title)s“ wurde gesendet

source: Confirmation email sent
de: Bestätigungs-E-Mail wurde gesendet

source: We sent an email with a confirmation link to your email address.
de: Wir haben eine E-Mail mit einem Bestätigungslink an deine E-Mail-Adresse gesendet.

source: You need to follow that link in the email to confirm your reservation for „<a href="%(talk_details)s">%(title)s</a>“.
de: Bitte folge dem Link in der E-Mail, um deine Reservierung für „<a href="%(talk_details)s">%(title)s</a>“ zu bestätigen.

source: Spot for „%(title)s“ confirmed
de: Platzreservierung für „%(title)s“ bestätigt

source: Your spot is confirmed
de: Deine Platzreservierung ist bestätigt

source: You successfully confirmed the reservation of your spot for „<a href="%(talk_details)s">%(title)s</a>“.
de: Du hast deine Platzreservierung für „<a href="%(talk_details)s">%(title)s</a>“ erfolgreich bestätigt.

source: Reserve spot for „%(title)s“
de: Platz für „%(title)s“ reservieren

source: Session is fully booked
de: Session ist ausgebucht

source: The session „%(title)s“ is fully booked.
de: Die Session „%(title)s“ ist ausgebucht.

source: Click the button below to get on the waiting list.
de: Klicke auf den unten stehenden Button, um auf der Warteliste eingetragen zu werden.

source: Reserve your spot for „%(title)s“
de: Reserviere deinen Platz für „%(title)s“

source: Click the button below to reserve your spot for the session.
de: Klicke auf den unten stehenden Button, um deinen Platz für die Session zu reservieren.

source: Get on the waiting list
de: Auf die Warteliste setzen

source: Reserve spot
de: Platz reservieren

source: Resend reservation mail for „%(title)s“
de: Bestätigungs-E-Mail für „%(title)s“ erneut senden

source: Resend the reservation mail
de: Bestätigungs-E-Mail erneut senden

source: You reserved a spot in „%(title)s“ but have not confirmed your reservation yet.
de: Du hast einen Platz für „%(title)s“ angefragt aber deine Reservierung noch nicht bestätigt.

source: If you have not received the email with the confirmation link you can resend it by clicking on the button below.
de: Wenn du die E-Mail mit dem Bestätigungslink noch nicht erhalten hast, kannst du dir mit einem Klick auf den unten stehenden Button einen neuen Bestätigungslink zusenden lassen.

source: Resend confirmation mail
de: Bestätigungs-E-Mail erneut senden

source: Waiting list for „%(title)s“
de: Warteliste für „%(title)s“

source: The session is fully booked.
de: Die Session ist ausgebucht.

source: You are now placed on the waiting list for this session and will be notified if a spot becomes available.
de: Du stehst jetzt auf der Warteliste für diese Session und wirst benachrichtigt, wenn ein Platz frei wird.

source: Hello %(shortname)s, thank you for your interest to speak at Dev Day 2018. To finish your registration please click the following link to verify your email address.
de: Hallo %(shortname)s, danke, dass du auf dem Dev Day sprechen möchtest. Um deine Anmeldung abzuschließen klicke bitte auf den folgenden Link, um deine E-Mail-Adresse zu bestätigen.

source: The link is valid for one day.
de: Der Link ist für einen Tag gültig.

source: You will be able to use your account to add additional sessions and to change your short biography, photography and session information. The Dev Day team -- https://www.devday.de/
de: Du kannst dein Benutzerprofil verwenden, um weitere Sessions einzureichen und um deine Kurzvita, dein Speakerbild und Sessioninformationen zu ändern. Das Dev Day-Team -- https://www.devday.de/

source: Confirm your speaker registration
de: Bestätige deine SpeakerInanmeldung

source: Speaker profile
de: SpeakerInprofil

source: Speaker profile for %(username)s
de: SpeakerInprofil für %(username)s

source: Email address
de: E-Mail-Adresse

source: Short biography
de: Kurzvita

source: Speaker image
de: Speakerbild

source: Speaker profile for %(username)s
de: SpeakerInprofil für %(username)s

source: Firstname
de: Vorname

source: Lastname
de: Nachname

source: Your Sessions
de: Deine Sessions

source: Title
de: Titel

source: No sessions submitted.
de: Keine Sessions eingereicht.

source: Submit another session
de: Weitere Session einreichen

source: Submit a session
de: Session einreichen

source: Change password
de: Passwort ändern

source: Successfully registered as a speaker
de: Erfolgreich als SpeakerIn registriert

source: Talk submission closed
de: Sessioneinreichung geschlossen

source: You cannot submit new sessions currently.
de: Zur Zeit können keine weiteren Sessions eingereicht werden.

source: Session submitted
de: Session eingereicht

source: Visit your <a href="%(speaker_profile)s">speaker profile</a> to see all your sessions.
de: Besuche dein <a href="%(speaker_profile)s">SpeakerInprofil</a>, um deine eingereichten Sessions anzusehen.

source: A new comment has been added for your talk submitted for %(event)s under the title %(talk_title)s "%(comment)s" by %(commenter)s at %(commented_at)s You may respond to this comment by visiting
de: Für den Vortrag mit dem Titel "%(talk_title)s", den du für den %(event)s eingereicht hast, wurde folgender neuer Kommentar hinzugefügt: "%(comment)s" von %(commenter)s am %(commented_at)s Du kannst auf diesen Kommentar antworten, indem du folgenden Link aufrufst:

source: The Dev Day team -- https://www.devday.de/
de: Das Dev Day-Team -- https://www.devday.de/

source: [devday] New comment on your talk submission %(talk_title)s
de: [devday] Neuer Kommentar für deine Sessioneinreichung %(talk_title)s

source: Votes
de: Bewertungen

source: Average vote
de: Durchschnittliche Bewertung

source: average vote
de: durchschnittliche Bewertung

source: No votes yet
de: Noch keine Bewertungen

source: Your vote
de: Deine Bewertung

source: your vote
de: deine Bewertung

source: Delete
de: Löschen

source: Comments
de: Kommentare

source: visible
de: sichtbar

source: private
de: privat

source: delete
de: löschen

source: No comments yet
de: Noch keine Kommentare

source: Back to list of sessions
de: Zurück zur Session-Liste

source: List of sessions
de: Session-Liste

source: Vote average
de: Durchschnittliche Bewertung

source: Vote sum
de: Gesamtbewertung

source: (Sum %(vote_sum)s in %(vote_count)s vote)
de: (Insgesamt %(vote_sum)s bei %(vote_count)s Stimme)

source: There are no talks yet.
de: Es wurden noch keine Sessions eingereicht.

source: Slide deck
de: Folien

source: Example code
de: Beispielcode

source: Your feedback for this session
de: Dein Feedback für diese Session

source: Room:
de: Raum:

source: Feedback summary
de: Feedback-Zusammenfassung

source: Feedback summary - top 5 sessions
de: Feedback-Zusammenfassung - Top 5 Sessions

source: 1 Vote
de: Eine Bewertung

source: No session feedback found
de: Kein Session-Feedback vorhanden

source: Submit session
de: Session einreichen

source: Submit a session for %(event_title)s
de: Eine Session für %(event_title)s einreichen

source: Schedule
de: Sessionplan

source: Time
de: Zeit

source: Nothing scheduled here
de: Hier ist noch nichts geplant

source: Unscheduled talks
de: Sessions ohne Zuordnung

source: Needs reservation
de: Platzreservierung erforderlich

source: Workshop / Excursion reservation
de: Reservierung für Workshop / Exkursion

source: Reserve your spots
de: Plätze reservieren

source: There are no workshops or excursions that need a reservation.
de: Es gibt keine Workshops oder Exkursionen, für die Plätze reserviert werden können.

source: Fully booked
de: Session ist ausgebucht

source: Reservation
de: Platzreservierung

source: Remove from waiting list
de: Aus der Warteliste entfernen

source: Archive: List of Talks at
de: Archiv: Liste der Vorträge vom

source: Slide Deck
de: Folien

source: Schedule Preview
de: Sessionvorschau

source: Planned talks
de: Geplante Sessions

source: Edit session
de: Session bearbeiten

source: %(event.title)s - Videos, Slides and Example Code
de: %(event.title)s - Videos, Folien und Beispielcode

source: Videos, Slides and Example Code for %(event.title)s
de: Videos, Folien und Beispielcode für %(event.title)s

source: No videos, slides or example code found.
de: Keine Videos, Folien oder Beispielcode gefunden.

source: Videos and Slides for %(event)s have not been published yet.
de: Es wurden noch keine Videos und Folien für %(event)s veröffentlicht.

source: Schedule preview and voting
de: Sessionvorschau und Abstimmung

source: Vote for your favourite sessions
de: Stimme für deine bevorzugten Sessions

source: You may vote for your favourite sessions. We will use the voting results to plan the room assignments.
de: Hier kannst du für die Sessions abstimmen, die dich am meisten interessieren. Wir werden die Abstimmungsergebnisse bei der Raumzuordnung für die Sessions zu berücksichtigen.

source: Results
de: Ergebnisse

source: Average: %(average)s (Votes: %(count)s)
de: Durchschnitt: %(average)s (Stimmen: %(count)s)

source: There are no sessions published yet.
de: Es wurden noch keine Sessions veröffentlicht.

source: This field is required.
de: Dieses Feld ist erforderlich.

source: This confirmation key has expired.
de: Der Bestätigungslink ist abgelaufen.

source: The confirmation key you provided is invalid.
de: Der Bestätigungslink ist ungültig.

source: The talk is overbooked.
de: Die Session ist überbucht.

source: You can confirm your own reservations only.
de: Du kannst nur deine eigenen Reservierungen bestätigen.
