Repository: devdaydresden/devday_website
Catalog: devday/attendee/locale/*/LC_MESSAGES/django.po
Languages: de

source: Permissions
de: Berechtigungen

source: Important dates
de: Wichtige Termine

source: Attendee management
de: Teilnehmerverwaltung

source: Check in
de: Einchecken

source: Check in summary
de: Check-In-Zusammenfassung

source: Contact for other events
de: Kontaktaufnahme zu weiteren Veranstaltungen

source: I would like to receive updates related to events organized by the T-Systems Multimedia Solutions GmbH Software Engineering Community via email.
de: Ich möchte Updates zu Veranstaltungen der T-Systems Multimedia Solutions GmbH Software Engineering Community per E-Mail erhalten.

source: Contact permission granted on
de: Erlaubnis zur Kontaktaufnahme erteilt am

source: Delete your account
de: Dein Teilnehmerprofil löschen

source: Change password
de: Passwort ändern

source: Update your profile
de: Profil aktualisieren

source: By clicking the button below I express my intent to attend the event {event} and agree to be contacted by the Dev Day organizers about conference details.
de: Durch Klick auf den unten stehenden Button bestätige ich meine Absicht an der Veranstaltung {event} teilzunehmen und stimme zu, dass mich die Dev Day-Organisatoren zu Details zur Konferenz kontaktieren dürfen.

source: Register as attendee
de: Als Teilnehmer anmelden

source: Login and enroll now
de: Jetzt einloggen und anmelden

source: Permit contact
de: Kontaktaufnahme erlauben

source: Register for an account
de: Ein Benutzerkonto registrieren

source: <p class="text-info">By registering as an attendee, I agree to be contacted by the Dev Day organizers about conference details.</p></label>
de: <p class="text-info">Durch meine Registrierung als Teilnehmer stimme ich zu, dass mich die Dev Day-Organisatoren über Details zur Konferenz kontaktieren dürfen.</p>

source: Attendee check in code or email address
de: Teilnehmer-Check-In-Code oder -Email-Adresse

source: Check in this attendee
de: Diesen Teilnehmer einchecken

source: Unknown checkin code or email address, or attendee is not registered for the current event.
de: Unbekannter Check-In-Code oder Email-Adresse, oder der Teilnehmer ist nicht für die aktuelle Veranstaltung registriert.

source: {} is already checked in!
de: {} ist bereits eingecheckt!

source: How much did you like the Event?
de: Wie gut hat Dir die Veranstaltung gefallen?

source: How well has the event been organised?
de: Wie zufrieden warst Du mit der Organisation?

source: How much did the sessions fulfill your expectations?
de: Inwieweit haben die Sessions Deine Erwartungen erfüllt?

source: Please tell us what you liked specifically and what should be different next time.
de: Gerne kannst Du uns in dem nachfolgenden Freitextfeld mitteilen, was Dir besonders gut gefallen hat oder was das nächste Mal anders sein sollte.

source: Submit your feedback
de: Feedback abschicken

source: Submit your badge data
de: Deine Badge-Daten anpassen

source: email address
de: E-Mail-Adresse

source: active
de: aktiv

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
de: Gibt an, ob dieser Nutzer als aktiv behandelt werden soll. Wähle dies ab, anstatt Nutzer zu löschen.

# devday website
source: date joined
de: Anmeldedatum

source: contact permission date
de: Kontaktaufnahme erteilt

source: user
de: Nutzer

source: users
de: Nutzer

source: Event
de: Veranstaltung

source: Code to check in attendee manually
de: Code zum manuellen Einchecken des Teilnehmners

source: Checked-In
de: Eingecheckt

source: Date and time the attendee checked in
de: Datum und Uhrzeit, zu der der Teilnehmer eingecheckt hat

source: source
de: Informationsquelle

source: How have you become aware of this event?
de: Wie bist du auf den Dev Day aufmerksam geworden?

source: raffle
de: Verlosung

source: Take part in the raffle
de: An der Verlosung teilnehmen

source: Attendee
de: Teilnehmer

source: Attendees
de: Teilnehmer

source: {email} at {event}
de: {email} für {event}

source: Title
de: Titel

source: How would you like to be named
de: Wie möchtest du genannt beziehungsweise angesprochen werden

source: Contact
de: Kontakt

source: optional contact information (i.e. a Twitter handle)
de: optionale Kontaktinformation (z.B. ein Twitter-Handle)

source: Topics
de: Themen

source: Topics you would like to talk about
de: Themen über die du gern sprechen möchtest

source: Badge data
de: Badge-Daten

source: Event score
de: Bewertung Veranstaltung

source: Organisation score
de: Bewertung Organisation

source: Session score
de: Bewertung Sessions

source: Comment
de: Kommentar

# attendee event feedback singular form
source: Attendee event feedback
de: Teilnehmerfeedback für Veranstaltung

# attendee event feedback plural form
source: Attendee event feedback
de: Teilnehmerfeedback für Veranstaltung

source: Hello, thank you for registering for %(event_title)s! please click on the link below to confirm your intent to attend the event %(event_title)s
de: Hallo, danke für deine Anmeldung für die Veranstaltung %(event_title)s! Bitte klicke auf den unten stehenden Link, um deinen Teilnahmewunsch für die Veranstaltung %(event_title)s zu bestätigen.

source: The link is valid for one day.
de: Der Link ist für einen Tag gültig.

source: The Dev Day team
de: Das Dev Day Team

source: Hello, thank you for registering for %(event_title)s! To complete your registration please confirm your email address by clicking the following link.
de: Hallo, danke für deine Anmeldung für die Veranstaltung %(event_title)s! Um deine Anmeldung abzuschließen, verifiziere bitte deine Email-Adresse durch Klick auf diesen Link:

source: Confirm your attendance for %(event_title)s
de: Bestätige deine Teilnahme bei der Veranstaltung %(event_title)s

source: Confirm your registration
de: Anmeldung bestätigen

source: Attendee confirmation failed
de: Anmeldebestätigung fehlgeschlagen

source: Back to <a href="%(root_page)s">home page</a>.
de: Zurück zur <a href="%(root_page)s">Startseite</a>.

source: Raffle for %(event)s
de: Verlosung für %(event)s

source: Raffle
de: Verlosung

source: Next winner
de: Nächster Gewinner

source: Nobody in the raffle
de: Niemand nimmt an der Verlosung teil

source: No more attendees in the raffle
de: Keine weiteren Teilnehmer für die Verlosung

source: Registration for %(event)s completed
de: Registrierung für die Veranstaltung %(event)s abgeschlossen

source: Attendee registration completed
de: Teilnehmeranmeldung abgeschlossen

source: You have completed the registration for the event &quot;%(event)s&quot;.
de: Du hast deine Anmeldung für die Veranstaltung &quot;%(event)s&quot; abgeschlossen.

source: Visit <a href="%(user_profile)s">your user profile</a> to review your registration.
de: Besuche dein <a href="%(user_profile)s">Benutzerprofil</a>, um deine Anmeldung zu prüfen.

source: Registration for %(event)s successful
de: Registrierung für die Veranstaltung %(event)s erfolgreich

source: Attendee registration successful
de: Teilnehmeranmeldung erfolgreich

source: You are now registered for the event &quot;%(event)s&quot;.
de: Du bist jetzt für die Veranstaltung &quot;%(event)s&quot; angemeldet.

source: Please fill your badge information.
de: Bitte fülle die Informationen für dein Badge aus.

source: Badge preview
de: Badge-Vorschau

source: Register for %(event_title)s
de: Für %(event_title)s registrieren

source: Attend %(event_title)s
de: Für %(event_title)s anmelden

source: You need an account on this site to attend %(event_title)s. Please register an account using your email address.
de: Du benötigst ein Benutzerkonto auf dieser Seite, um an der Veranstaltung %(event_title)s teilzunehmen. Bitte registriere ein Benutzerkonto durch Angabe deiner E-Mail-Adresse.

source: Please click on the button below to attend the event %(event_title)s.
de: Bitte klicke auf den unten angezeigten Button, um an der Veranstaltung %(event_title)s teilzunehmen.

source: Registration for %(event_title)s pending
de: Anmeldebestätigung für die Veranstaltung %(event_title)s steht noch aus

source: Attendee registration pending
de: Bestätigung der Teilnehmeranmeldung ausstehend

source: You are almost done with your registration for the event &quot;%(event_title)s&quot; please click on the activation link contained in the email we sent to your registered email address.
de: Du bist mit deiner Anmeldung für die Veranstaltung &quot;%(event_title)s&quot; fast fertig. Bitte klicke zur Bestätigung auf den Bestätigungslink, den wir an deine hinterlegte E-Mail-Adresse geschickt haben.

source: Edit your badge data for %(event)s successful
de: Badge-Datenbearbeitung für %(event)s erfolgreich

source: Edit your badge data
de: Bearbeite deine Badge-Daten

source: You are registered for the event &quot;%(event)s&quot;.
de: Du bist für die Veranstaltung &quot;%(event)s&quot; angemeldet.

source: QR Code to check in at %(current_event)s on location
de: QR-Code zum Checkin vor Ort bei %(current_event)s

source: Your check in code:
de: Dein Check-In-Code:

source: QR code not working?
de: QR-Code funktioniert nicht?

source: Go to manual check in
de: Zum manuellen Checkin

source: Hello, thank you for registering an account for the Dev Day website! To complete your registration please confirm your email address by clicking the following link.
de: Hallo, danke für die Registrierung eines Benutzerkontos auf der Dev Day website! Um deine Anmeldung abzuschließen, verifiziere bitte deine Email-Adresse durch Klick auf diesen Link:

source: Delete profile
de: Teilnehmerprofil löschen

source: Delete your profile %(username)s
de: Dein Teilnehmerprofil %(username)s löschen

source: Do you really want to delete your profile? You will not get information related to current and future events and you will have to register again if you choose to attend one of our future events.
de: Willst du dein Teilnehmerprofil wirklich löschen? Die Löschung hat zur Folge, dass du keine Informationen zu aktuellen und zukünftigen Veranstaltungen mehr von uns bekommen wirst. Du wirst dich neu anmelden müssen, wenn du dich zukünftig entscheidest wieder an einer unserer Veranstaltungen teilzunehmen.

source: You are registered as speaker and your following talk is not published yet and will be deleted:
de: Du bist als SpeakerIn angemeldet und deine folgende Session wurde noch nicht veröffentlicht und wird gelöscht:

source: Confirm
de: Bestätigen

source: Back to your profile
de: Zurück zu deinem Benutzerprofil

source: Feedback for %(event)s
de: Feedback für %(event)s

source: Your feedback for %(event)s
de: Dein Feedback zum %(event)s

source: from one attendee
de: eines Teilnehmers

source: Register for %(current_event)s
de: Für %(current_event)s anmelden

source: Register now
de: Jetzt registrieren

source: Did you attend Dev Day last year? Use your existing credentials!
de: Du warst schon mal beim Dev Day? Dann nutze deine vorhandenen Anmeldedaten!

source: Forgotten password?
de: Passwort vergessen?

source: Reset it!
de: Zurücksetzen!

source: You are already logged in, great! You may proceed to register for %(current_event)s directly.
de: Super, du bist schon eingeloggt! Damit kannst du dich direkt für die Teilnahme an der Veranstaltung %(current_event)s anmelden!

source: Register
de: Anmelden

source: Attendee profile
de: Teilnehmerprofil

source: User profile for %(username)s
de: Nutzerprofil für %(username)s

source: Speaker
de: SpeakerIn

source: You are registered as speaker &quot;%(speaker_name)s&quot;. Visit your <a href="%(speaker_profile)s">speaker details page</a> to update your speaker data.
de: Du bist als SpeakerIn &quot;%(speaker_name)s&quot; angemeldet. Besuche deine <a href="%(speaker_profile)s">SpeakerIndetailseite</a>, um deine SpeakerIndaten zu aktualisieren.

source: Events
de: Veranstaltungen

source: You are registered for these events
de: Du bist angemeldet für diese Veranstaltungen

source: You are a confirmed attendee of this session
de: Deine Teilnahme an dieser Session ist bestätigt

source: Cancel reservation
de: Anmeldung stornieren

source: You are on a waiting list for this session
de: Du bist auf der Warteliste für diese Session

source: Remove from waiting list
de: Von der Warteliste entfernen

source: You have not confirmed your reservation for this session
de: Du hast deine Reservierung für diese Session noch nicht bestätigt

source: Resend confirmation mail
de: Bestätigungs-E-Mail erneut senden

source: Edit badge data
de: Badge-Daten bearbeiten

source: Cancel Registration
de: Anmeldung stornieren

source: You are not currently registered to participate in any event.
de: Du bist zur Zeit für keine Veranstaltung angemeldet.

source: Checkin summary for %(event)s
de: Check-In-Zusammenfassung für %(event)s

source: Sessions with limited attendees
de: Sessions mit begrenzter Teilnehmerzahl

source: No sessions with limited attendees.
de: Keine Sessions mit begrenzter Teilnehmerzahl vorhanden.

source: {} at {}
de: {} für {}

source: You are already checked in.
de: Du hast bereits eingecheckt.

source: You are not registered for the current event.
de: Du bist nicht für die aktuelle Veranstaltung angemeldet.

source: Account does not match the activation code
de: Benutzerkonto passt nicht zum Aktivierungscode

source: Attendee has confirmed place for
de: Teilnehmer hat reservierten Platz für

source: Attendee has no reservations.
de: Teilnehmer hat keine Reservierungen.

source: <b>{email}</b> has been checked in successfully to {event}!
de: <b>{email}</b> wurde erfolgreich für {event} eingecheckt!

source: Invalid verification URL
de: Ungültige Verifizierungs-URL

source: Try again scanning the QR code.
de: Den QR-Code nochmal scannen.

source: Attendee not found
de: Teilnehmer nicht gefunden

source: The attendee is (no longer) registered.
de: Der Teilnehmer ist (nicht mehr) registriert.

source: Code is for the wrong event
de: Der Code ist für die falsche Veranstaltung

source: This checkin code is for another event.
de: Der Checkin-Code ist für eine andere Veranstaltung.

source: Already checked in
de: Bereits eingecheckt

source: Attendee <b>{}</b> has checked in at {}.
de: Teilnehmer <b>{}</b> hat bereits um {} eingecheckt.

source: Welcome!
de: Willkommen!

source: Attendee <b>{}</b> was successfully checked in.
de: Teilnehmer <b>{}</b> wurde erfolgreich eingecheckt.
