{
    "speakers": [
        {
            "name": "Adam Bien",
            "img": "Adam_Bien.jpg",
            "profession": "Java Rock Star",
            "information": "<p>Consultant and author Adam Bien is an Expert Group member for the Java EE 6 and 7, EJB 3.X, JAX-RS, and JPA 2.X JSRs. He has worked with Java technology since JDK 1.0 and with Servlets/EJB 1.0 and is now an architect and developer for Java SE and Java EE projects. He has edited several books about JavaFX, J2EE, and Java EE, and he is the author of Real World Java EE Patterns—Rethinking Best Practices and Real World Java EE Night Hacks—Dissecting the Business Tier. Adam is also a Java Champion, Top Java Ambassador 2012, and JavaOne 2009, 2011, 2012, 2013 and 2014 Rock Star. Adam occasionally organizes Java EE workshops at Munich’s airport (http://airhacks.com). </p>",
            "sessions": [
                "adam_bien_1"
            ],
            "ids": {
            }
        },
        {
            "name": "Artur Speth",
            "img": "Artur_Speth.jpg",
            "profession": "ALM Architect",
            "information": "<p>Artur Speth arbeitet als ALM-Architect in der Microsoft Developer Experience Group (DX) und ist Spezialist für Visual Studio und Application Lifecycle Management. Nach seinem Aufenthalt in der Visual Studio-Produktgruppe beschäftigt er sich intensiv mit dem Thema DevOps und wie dieser Trend innerhalb von Microsoft adaptiert wird. Zuvor war er im Microsoft Partner Support als technischer Berater für die Visual Studio ALM-Plattform tätig. Aus dieser Zeit kann er auf umfangreiche Erfahrungen in der Zusammenarbeit mit Microsoft-Partnern im Bereich Softwareentwicklung und Software Development Lifecycle zurückgreifen. Online ist er über seinen Blog oder auf Twitter zu finden.</p>",
            "sessions": [
                "artur_speth_1"
            ],
            "ids": {
                "twitter": "arturspeth"
            }
        },
        {
            "name": "Dave Farley",
            "img": "DaveFarley.jpg",
            "profession": "Book Author and Software Developer",
            "information": "<p>Dave Farley is a thought-leader in the field of Continuous Delivery, DevOps and Software Development in general.</p><p>He is co-author of the Jolt-award winning book 'Continuous Delivery' a regular conference speaker and blogger and one of the authors of the Reactive Manifesto.</p><br><p>Dave has been having fun with computers for over 30 years. During that period he has worked on most types of software, from firmware, through tinkering with operating systems and device drivers, to writing games, and commercial applications of all shapes and sizes. He started working in large scale distributed systems about 25 years ago, doing research into the development of loose-coupled, message-based systems - a forerunner of MicroService architectures.</p><br><p>Dave has a wide range of experience leading the development of complex software in teams, both large and small, in the UK and USA. Dave was an early adopter of agile development techniques, employing iterative development, continuous integration and significant levels of automated testing on commercial projects from the early 1990s.</p><br><p>Dave is the former Head of Software development at LMAX Ltd, home of the OSS Disruptor, a company that are well known for the excellence of their code and the exemplary nature of their development process.</p><br><p>Dave is now an independent software developer and consultant, and founder and director of Continuous Delivery Ltd.</p>",
            "sessions": [
                "dave_farley_1",
                "dave_farley_2"
            ],
            "ids": {
                "twitter": "davefarley77"
            }
        },
        {
            "name": "Denis Loh",
            "img": "Denis_Loh.jpg",
            "profession": "Software Architect",
            "information": "<p>Denis Loh ist seit über zwei Jahren Softwarearchitekt in der T-Systems Multimedia Solutions GmbH und hat drei Jahre Erfahrung in der Entwicklung mobiler Apps für Android und iOS. Er beschäftigt sich sowohl beruflich als auch privat mit aktuellen Gadgets und technischen Herausforderungen rund um Beacons, Virtual Reality, Augmented Reality und IoT.</p>",
            "sessions": [
                "loh_lamack_1"
            ],
            "ids": {
            }
        },
        {
            "name": "Frank Lamack",
            "img": "Frank_Lamack.png",
            "profession": "Innovation Developer",
            "information": "<p>Seit 16 Jahren in der T-Systems Multimedia Solutions GmbH in verschiedenen Bereichen und Rollen tätig. Er hat langjährige Erfahrungen als Innovation Developer und Strategischer Berater im Umfeld 3D, sowohl auf Seiten der User Experience, Digital Products und 3D Printing. Er bildet dabei die Schnittstelle zwischen Kundenanforderungen, Creative und Technical Teams sowie – getrieben durch technologische Grenzbereiche – enge Vernetzung mit Forschungs- und Ausbildungseinrichtungen. Er betreute verschiedene Unternehmen aus den Branchen Telekomunikation, Automobilbau, Flugzeugbau, Maschinenbau, Baubranchen sowie Messen.</p>",
            "sessions": [
                "loh_lamack_1"
            ],
            "ids": {
            }
        },
        {
            "name": "Hendrik Lösch",
            "img": "Hendrik_Loesch.png",
            "profession": "Consultant und Trainer",
            "information": "<p>Hendrik Lösch ist ein Consultant und Trainer der Saxonia Systems AG mit dem Schwerpunkt Microsoft basierender Software Entwicklung. Darüber hinaus arbeitet er als freier Autor und Referent mit dem Fokus auf Testautomatisierung und Test Driven Development.</p>",
            "sessions": [
                "hendrik_loesch_1"
            ],
            "ids": {
            }
        },
        {
            "name": "Jan Dittberner",
            "img": "JanDittberner.jpg",
            "profession": "Software Architect",
            "information": "<p>Jan Dittberner ist Software-Architekt bei der T-Systems Multimedia Solutions GmbH. Er arbeitet seit mehreren Jahren als Architekt in einem großen E-Mail-Infrastrukturprojekt für ein großes deutsches Telekommunikationsunternehmen. Daneben engagiert er sich im DevOps-Programm innerhalb der T-Systems MMS und beschäftigt sich intensiv mit Themen wie Automatisierung, Versionskontrolle mit Git und PKI.</p><p>In seiner Freizeit arbeitet er als Developer im Debian Projekt und als Infrastrukturteamlead bei CAcert mit.</p>",
            "sessions": [
                "jan_dittberner_1"
            ],
            "ids": {
                "twitter": "jandd"
            }
        },
        {
            "name": "Peter Lehmann",
            "img": "Peter_Lehmann.jpg",
            "profession": "Test-automatisierer",
            "information": "<p>Peter Lehmann ist als Testdesigner und Testautomatisierer für Web-Frontend- und -Backend-Systeme gestartet und arbeitet jetzt als Testarchitekt im Test and Integration Center der T-Systems Multimedia Solutions GmbH. Er beschäftigt sich hauptsächlich mit der Testarchitektur für Automatisierungsprojekte sowie dem Entwurf und der Entwicklung von Testtreibern. Peter ist außerdem Tech Lead für das im Vortrag beschriebene Xeta-Framework und dessen Weiterentwicklung.</p>",
            "sessions": [
                "peter_lehmann_1"
            ],
            "ids": {
            }
        },
        {
            "name": "Sascha Askani",
            "img": "Sascha_Askani.jpg",
            "profession": "System Engineer",
            "information": "<p>Sascha Askani ist seit zwei Jahren als System Engineer bei der inovex GmbH in Pforzheim tätig. Seine Aufgaben umfassen die Konzeption, den Aufbau und den Betrieb hochverfügbarer Web- und Storage-Architekturen, auch im Cloud-Umfeld.</p>",
            "sessions": [
                "sascha_askani_1"
            ],
            "ids": {
            }
        },
        {
            "name": "Thomas Haase",
            "img": "thomashaase.jpg",
            "profession": "Security Tester",
            "information": "<p>Thomas Haase - Penetrationstester in den Bereichen Web-, Mobile- und Embedded Security und seit 2004 Projektfeldmanager \"Data Privacy and Security\" bei T-Systems Multimedia Solutions GmbH.</p><p>Seine Schwerpunkte sind Infrastructure and Application Security, Penetrations Tests und Source Code Analysen. Außerdem engagiert er sich als Dozent für verschiedene Bildungseinrichtungen im Bereich Security Awareness und Hacking. Er ist zertifiziert als ISO27001 Lead Auditor, Certified Ethical Hacker und TeleTrusT Information Security Professional (TISP).</p>",
            "sessions": [
                "thomas_haase_1"
            ],
            "ids": {
            }
        }
    ]
}
